export const wallType = [
    {
        name: "留言墙",
        description: "欢迎进来的朋友, 可以的话, 在我的草坪踩一踩!"
    },
    {
        name: "照片墙",
        description: "好吧, 手机空间余额不足, 发到网站上来."
    }
]

export const labelMap = [
    [
        {
            name: '全部',
            key: "all"
        },
        {
            name: '目标',
            key: "target",
        }, 
        {
            name: "无题",
            key: "none-title",
        },
        {
            name: '信条',
            key: 'creed',
        }],
    [
        {
            name: '全部',
            key: "all",
        },
        {
            name: '城市',
            key: "city",
        },
        {
            name: '风景',
            key: "scene",
        },
        {
            name: '英雄联盟',
            key: "LOL",
        },
        {
            name: '星空',
            key: 'star'
        }]
]

export const bgColorMap = [
    'rgba(252, 175, 162, 0.30)',
    'rgba(255, 227, 148, 0.30)',
    'rgba(146, 230, 245, 0.30)',
    'rgba(168, 237, 138, 0.30)',
    'rgba(202, 167, 247, 0.30)',
    'rgba(212, 212, 212, 0.30)',
]

export const bgColorMap1 = [
    'rgba(252, 175, 162, 1)',
    'rgba(255, 227, 148, 1)',
    'rgba(146, 230, 245, 1)',
    'rgba(168, 237, 138, 1)',
    'rgba(202, 167, 247, 1)',
    // 'rgba(212, 212, 212, 0.30)',
]

export const cardData = [
    {
        title: 'card1',
        date: "2023-05-20",
        content: "这是一段暖心的话，它或许不长，但是它是我现在最想说的。放在这里就留一个纪念吧，不用回头看，应为现在才是当下最好的。这是一段暖心的话，它或许不长，但是它是我现在最想说的。放在这里就留一个纪念吧。",
        author: "云帆",
    },
    {
        title: 'card2',
        date: "2023-05-20",
        content: "这是一段暖心的话，它或许不长，但是它是我现在最想说的。放在这里就留一个纪念吧，不用回头看，应为现在才是当下最好的。这是一段暖心的话，它或许不长，但是它是我现在最想说的。放在这里就留一个纪念吧。",
        author: "云帆",
        bgColor: "red",
    },
    {
        title: 'card3',
        date: "2023-05-20",
        content: "这是一段暖心的话，它或许不长，但是它是我现在最想说的。放在这里就留一个纪念吧，不用回头看，应为现在才是当下最好的。这是一段暖心的话，它或许不长，但是它是我现在最想说的。放在这里就留一个纪念吧。",
        author: "云帆",
        bgColor: "green",
    },
    {
        title: 'card4',
        date: "2023-05-20",
        content: "这是一段暖心的话，它或许不长，但是它是我现在最想说的。放在这里就留一个纪念吧，不用回头看，应为现在才是当下最好的。这是一段暖心的话，它或许不长，但是它是我现在最想说的。放在这里就留一个纪念吧。",
        author: "云帆",
    },
    {
        title: 'card5',
        date: "2023-05-20",
        content: "这是一段暖心的话，它或许不长，但是它是我现在最想说的。放在这里就留一个纪念吧，不用回头看，应为现在才是当下最好的。这是一段暖心的话，它或许不长，但是它是我现在最想说的。放在这里就留一个纪念吧。",
        author: "云帆",
    },
    {
        title: 'card6',
        date: "2023-05-20",
        content: "这是一段暖心的话，它或许不长，但是它是我现在最想说的。放在这里就留一个纪念吧，不用回头看，应为现在才是当下最好的。这是一段暖心的话，它或许不长，但是它是我现在最想说的。放在这里就留一个纪念吧。",
        author: "云帆",
    },
    {
        title: 'card7',
        date: "2023-05-20",
        content: "这是一段暖心的话，它或许不长，但是它是我现在最想说的。放在这里就留一个纪念吧，不用回头看，应为现在才是当下最好的。这是一段暖心的话，它或许不长，但是它是我现在最想说的。放在这里就留一个纪念吧。",
        author: "云帆",
    },
]